Revit 2027 API
SurfaceElementProjectionZ Enumeration
 Presets for given Analytical Projection Z.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum SurfaceElementProjectionZ
Public Enumeration SurfaceElementProjectionZ
public enum class SurfaceElementProjectionZ
type SurfaceElementProjectionZ
Members
Member name | Value | Description
BottomOrExterior | 2 |  Bottom for floor or Exterior Face for wall element.
CenterOfCore | 3 |  Center of core. Applicable for wall analytical model only.
CenterOfElement | 1 |  Center of element.
Plane | 4 |  Use a Plane for projection (e.g., Grid, Level).
TopOrInterior | 0 |  Top for floor or Interior Face for wall element.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace